LEXICON_RU = {
# command descriptions
"DnD_command_description":
"""Начните игру DnD!
""",
"cancel_command_description":
"""Отмена действий
""",
"action_command_description":
"Описать свое следующее действие",
"master_command_description":
"Обратиться к Мастеру",
"stats_command_description":
"""Характеристики вашего персонажа""",
"help_command_description":
"""Описание команд""",
##############

"help_command":
"""🎲 Приветствую, герой! 🎲

Я – твой AI-гид по миру D&D. Управляй мной голосом или текстом! 🗣️

🔹 Основные команды:

 • /dnd – Запусти игру и начни своё приключение.
 • /cancel – Заверши текущую игру.

🔹 Во время игры:

 • /action – Выполни действие в игре, например, атаку или проверку навыка.
 • /master – Задай вопрос ведущему или попроси совета. Подходит для получения дополнительной информации или помощи во время игры.
 • /stats – Проверь характеристики своего персонажа, такие как здоровье, силы и умения.

Во время игры вы можете отправлять голосовые команды для /action и /master. 🎙️ Просто введите команду и скажите, что хотите сделать или спросить, и я всё выполню! 🚀
⚠️ Перед началом использования бота в группе, пусть каждый участник отправит любое сообщение после добавления бота, чтобы бот его запомнил
""",
"not_in_group":
"""🎲 Добро пожаловать в мир Dungeons & Dragons! 🎲

Я – Jafim, и я буду вашим Dungeon Master’ом. Будучи нейросетью, я открываю перед вами бескрайние возможности: бесконечные миры, захватывающие сюжеты и героев, чья мощь не знает границ. 🌟

Просто добавьте меня в группу и начните своё приключение уже сейчас! 🚀

⚠️ Не забудьте сделать меня администратором, иначе я не смогу видеть ваши сообщения и помогать вам в игре!
""",


"DnD_init":
"""✨ Готовы к приключению? ✨

Сегодня вашим Dungeon Master будет… нейросеть! 🧠

🎲 Любите классику? Исследуйте древние руины или отправляйтесь в погоню за легендарным рыцарем.

🚀 Хотите чего-то необычного? Космические странствия, битвы с роботами или даже игры со временем — всё в ваших руках!

Расскажите, какое приключение вам по душе, и я создам мир, полный опасностей и тайн.

💥 Вперёд, герои! Вас ждут незабываемые испытания!
""",


"DnD_generating_adventure":
"""Хмм.. звучит интересно! Дайте подумать минутку...
""",
"DnD_is_adventure_ok":
"""Понравилось?""",
"DnD_is_adventure_ok_yes_butt":
"""✅Да!""",
"DnD_is_adventure_ok_no_butt":
"""❌Нет, переделывай""",
"DnD_is_adventure_ok_no":
"""Хорошо, вот еще идея...""",
"cancel_handler":
"""Действия отменены.""",
"DnD_init_players":
"""🎉 Отлично! Пришло время познакомиться с вашими героями! 🎉

Теперь пусть каждый игрок в ОДНОМ сообщении расскажет о своём персонаже. Описание должно включать:

🔹 Раса и имя
🔹 Краткая предыстория
🔹 2 ключевых навыка
🔹 Оружие или особые артефакты
🔹 Внешний вид

И любые другие детали, которые вам захочется добавить! 😉

📝 Создайте своего героя и отправьте описание – мы готовы к приключению!
""",
"amount_of_players":
"""
Сколько будет игроков? Напишите число
""",
"amount_of_players_wrong_format":
"""
Число, пожалуйста.
""",
"already_in_db":
"""{name}, вы уже описывали своего персонажа.""",
"game_started":
"""🚀 Ну что ж, герои, время пришло! 🚀

Игроки уже описали своих персонажей, и мы готовы начать наше увлекательное приключение! 🌟

Вперёд к новым высотам и захватывающим событиям! 🗺️✨""",
"wait_other_players":
"""Отлично, %s, ждем остальных игроков""",
"take_action":
"""🤔 Что вы планируете делать дальше? 🤔

Вы можете обсудить свои планы с товарищами по команде или задать мне вопросы с помощью команды /master. 🗣️

Когда решите, какое действие предпринять, отправьте команду /action с вашим выбором! 🚀🗡️

Вперёд, к новым приключениям! 🌟""",
"action_empty":
"""Что же вы хотите сделать?""",
"master_empty":
"""Я вас слушаю, %s""",
"generating_starting_location":
"""Создаю стартовую локацию...""",
"extracting_hero_data":
"""Так, сейчас запишу, подождите...""",
"extracted_hero_data":
"""Да, записал""",
"master_answering":
"""
Секунду, %s, сейчас отвечу...
""",
"already_took_action":
"""%s, ты уже совершил свое действие, подожди других игроков""",
"next_turn":
"""Все игроки сделали свои ходы! Что же будет дальше?..""",
"roll":
"""
Кидай мне на %s!
""",
"roll_butt":
"""
🎲 Бросить d20 🎲
""",
"rolling":
"""И результат...""",


"lore_preloader":
"""✍️ Сочиняю предысторию...""",
"image_preloader":
"""🎨 Рисую картину...""",
"hero_image_preloader":
"""🎨 Рисую вашего персонажа...""",
"voice_preloader":
"""🎙️ Репетирую речь...""",


"transcripted":
"""Распознано:\n%s
""",
"roll_result":
"""
▶️{roll} (бросок)
🔻{level} (сложность)
✳️{mastery} (ваша {mastery_type})

🟰{result} (результат)
""",
"experience_gain_message":
"""
✴️Заработано опыта <b>{skill}</b>: {gained_experience}✴️
До следующего уровня: <b>{left_to_new_level}</b> опыта
""",
"levelup_message":
"""
❇️НОВЫЙ УРОВЕНЬ!❇️
{:^16s}
{:^16d}
""", # with 16 everything looks symmetric
"content_policy_violation_warning":
"""Ваш запрос содержит недопустимый для нейросети контент. Избавляемся от лишнего контента...""",
"openai_error_warning":
"""С OpenAI опять какие-то проблемы.
К сожалению, сейчас бот работать не сможет(""",
"content_policy_violation_retries_exhausted":
"""Мы испробовали все. Запрос подавлен.""",
"unblocked_api_calls":
"""Запросы к нейросети разрешены.""",
"stats":
"""
------{name}------
{data}
""",
"already_pending":
"""Подождите, нейросеть еще обрабатывает запрос...""",
"invalid_hero_data":
"""Странный герой какой-то... Попробуйте еще раз"""
}
STATS_RU = {
"race": "Раса",
"skill1": "Умение",
"skill2": "Умение",
"weapon": "⚔️Оружие⚔️",
"health": "❤️Здоровье❤️",
"location": "Локация",
"Сила": "💪Сила",
"Ловкость": "🏃‍♂️Ловкость",
"Интеллект": "🧠Интеллект",
"Мудрость": "🌳Мудрость"
}