LEXICON_RU = {
# command descriptions
"DnD_command_description":
"""Начните игру DnD!
""",
##############
"not_in_group":
"""*Добро пожаловать на просторы Dungeons and Dragons!*

Я, Евпатий, буду вашим _Dungeon Master_'ом. И так как я – нейросеть, \
возможности вашей игры будут безграничными, просторы мира – бесконечными,
и мощь ваших персонажей – неописуемой.
Добавьте меня в группу и начните играть уже сейчас!
*Не забудьте сделать меня администратором в группе, иначе я не смогу видеть ваши сообщения.*
""",
"DnD_init":
"""Ну что ж.\nСегодня ваш DM – нейросеть, поэтому сюжет будет создан мгновенно.
Любите классику?\nТогда создайте сюжет о возрождении древнего колосса \
или путешествии по следам великого рыцаря.
Хотите выжать все из воображения нейросети?\nПопробуйте что-то из научной фантастики!
Может, вам интересны путешествия во времени? А как насчет войны с роботами? Все зависит от вас!
Все что от вас нужно — это отправить мне то, что вы хотите видеть в вашем приключении, \
какие задания выполнять, с какими чудовищами тягаться.
Вперед, исследователи!
""",
"DnD_generating_adventure":
"""Хмм.. звучит интересно! Дайте подумать...
""",
"DnD_name_of players":

}
