LEXICON_RU = {
# command descriptions
"DnD_command_description":
"""Начните игру DnD!
""",
"cancel_command_description":
"""Отмена действий
""",
"action_command_description":
"Описать свое следующее действие",
"master_command_description":
"Обратиться к Мастеру",
##############


"not_in_group":
"""*Добро пожаловать на просторы Dungeons and Dragons!*

Я, Евпатий, буду вашим _Dungeon Master_'ом. И так как я – нейросеть, \
возможности вашей игры будут безграничными, просторы мира – бесконечными,
и мощь ваших персонажей – неописуемой.
Добавьте меня в группу и начните играть уже сейчас!
*Не забудьте сделать меня администратором в группе, иначе я не смогу видеть ваши сообщения.*
""",


"DnD_init":
"""Ну что ж.\nСегодня ваш DM – нейросеть, поэтому сюжет будет создан мгновенно.
Любите классику?\nТогда создайте сюжет о возрождении древнего колосса \
или путешествии по следам великого рыцаря.
Хотите выжать все из воображения нейросети?\nПопробуйте что-то из научной фантастики!
Может, вам интересны путешествия во времени? А как насчет войны с роботами? Все зависит от вас!
Все что от вас нужно — это отправить мне то, что вы хотите видеть в вашем приключении, \
какие задания выполнять, с какими чудовищами тягаться.
Вперед, исследователи!
""",


"DnD_generating_adventure":
"""Хмм.. звучит интересно! Дайте подумать минутку...
""",
"DnD_is_adventure_ok":
"""Понравилось?""",
"DnD_is_adventure_ok_yes_butt":
"""✅Да!""",
"DnD_is_adventure_ok_no_butt":
"""❌Нет, переделывай""",
"DnD_is_adventure_ok_no":
"""Хорошо, вот еще идея:""",
"cancel_handler":
"""Действия отменены.""",
"DnD_init_players":
"""Отлично, теперь пускай каждый игрок расскажет о своем персонаже в **ОДНОМ** сообщении.
Описывайте своего персонажа, его имя и характеристики, включая:
- Расу
- Краткую предысторию
- 2 Навыка
- Оружие
- Внешний вид
И прочее :)
""",
"amount_of_players":
"""
Сколько будет игроков? Напишите число
""",
"amount_of_players_wrong_format":
"""
Число, пожалуйста.
""",
"already_in_db":
"""{name}, вы уже описывали своего персонажа.""",
"game_started":
"""Ну что ж, раз игроки описали своих игроков, мы начинаем!""",
"wait_other_players":
"""Отлично, %s, ждем остальных игроков""",
"take_action":
"""Что вы собираетесь делать?
Вы можете посовещаться друг с другом, а также можете спросить меня с помощью команды /master.
Когда вы решитесь на действие, отправьте /action со своим действием!""",
"action_empty":
"""Что же вы хотите сделать?""",
"master_empty":
"""Я вас слушаю, %s""",
"generating_starting_location":
"""Создаю стартовую локацию...""",
"extracting_hero_data":
"""Так, сейчас запишу, подождите""",
"extracted_hero_data":
"""Да, записал""",
"master_answering":
"""
Секунду, %s, сейчас отвечу...
""",
"already_took_action":
"""%s, ты уже совершил свое действие, подожди других игроков""",
"next_turn":
"""Все игроки сделали свои ходы! Что же будет дальше?""",
"roll":
"""
Кидай мне на %s!
""",
"roll_butt":
"""
✅Кинуть d20✅
""",
"rolling":
"""И результат...""",


"text_preloader":
"""Сочиняю предысторию✍️...""",
"image_preloader":
"""Рисую картину🖼️...""",
"voice_preloader":
"""Репетиурую речь🎙️...""",


"transcripted":
"""Распознано:\n%s"""
}